## ASSIGNMENT - PANDAS BASIC

In [3]:
import pandas as pd

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
series_1 = pd.Series([4,8,15,16,23,42])

In [7]:
print(series_1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [8]:
lst_1 = [i for i in range(20) if i%2==0]

In [9]:
series_2 = pd.Series(lst)

print (series_2)

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:
Name Age Alice 25 Bob 30 Claire 27
Gender Female Male Female

In [51]:
lst_2 = [['Alice', 25, 'Female'], ['Bob', 30,  'Male'], ['Claire', 17, 'Female']]

In [52]:
df1 = pd.DataFrame(lst_2, columns = ['Name', 'Age', 'Gender'])

df1.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   17  Female

In [19]:
print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [33]:
'''
A DataFrame is 2 dimensional array having tabular structure and comprising of columns and rows. 
A pandas.Series is a 1 dimensional array having index. 
While pandas.Series can be thought of values of a column, DataFrame has more than 1 column.
'''


#Example of DataFrame:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [32]:
#Example of pandas.Series:
df1['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [13]:
#Slicing a dataframe

#by rows
print(df1[0:2])

#by loc
print('\n\n', df1.loc[1:2])

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male


      Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [29]:
#by iloc
df1.iloc[:3]

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [37]:
pd.DataFrame(df1.loc[0:2,'Gender'])

   Gender
0  Female
1    Male
2  Female

In [44]:
# Drop columns
df1.drop('Name', axis=1)

   Age  Gender
0   25  Female
1   30    Male
2   27  Female

In [45]:
col = ['Name', 'Gender']
df1.drop(col, axis=1)

   Age
0   25
1   30
2   27

In [48]:
# Drop Rows
df1.drop([0,1])

     Name  Age  Gender
2  Claire   27  Female

In [54]:
#Add columns
df1['Adult_flg'] = df1.Age.apply(lambda x: 'Y' if x>=18 else 'N')

In [55]:
df1

     Name  Age  Gender Adult_flg
0   Alice   25  Female         Y
1     Bob   30    Male         Y
2  Claire   17  Female         N

In [87]:
df2 = pd.DataFrame({'Name' : ['Alice', 'Neil', 'Claire', 'Bob'],
                    'Occupation' : ['Businessman', 'Chef', 'Actor', 'Builder'],
                    'Experience' : [15, 5, 10, 7]
                   })

In [88]:
df2

     Name   Occupation  Experience
0   Alice  Businessman          15
1    Neil         Chef           5
2  Claire        Actor          10
3     Bob      Builder           7

In [89]:
# Merge

df1.merge(df2, how='inner')

     Name  Age  Gender Adult_flg   Occupation  Experience
0   Alice   25  Female         Y  Businessman          15
1     Bob   30    Male         Y      Builder           7
2  Claire   17  Female         N        Actor          10

In [93]:
# Join 

df2.join(df1.set_index('Name'), on= 'Name')

     Name   Occupation  Experience   Age  Gender Adult_flg
0   Alice  Businessman          15  25.0  Female         Y
1    Neil         Chef           5   NaN     NaN       NaN
2  Claire        Actor          10  17.0  Female         N
3     Bob      Builder           7  30.0    Male         Y

In [98]:
# Rename columns

df1.columns= ['Name' , 'Age', 'Sex', 'Adult']

In [99]:
df1

     Name  Age     Sex Adult
0   Alice   25  Female     Y
1     Bob   30    Male     Y
2  Claire   17  Female     N

In [100]:
# Slicing based on condition

df1[df1.Adult == 'Y']

    Name  Age     Sex Adult
0  Alice   25  Female     Y
1    Bob   30    Male     Y

In [102]:
# Sorting dataframe based on value of a column
df1.sort_values('Age', ascending=False)

     Name  Age     Sex Adult
1     Bob   30    Male     Y
0   Alice   25  Female     Y
2  Claire   17  Female     N